examples/performance/01_single_phase_nozzle/flux/kurganov/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 252063.4;
    }
    outlet
    {
        type waveTransmissive;
        psi psi;
        gamma 1.2;
        fieldInf 101325;
        lInf 0.3461702088;
        value uniform 101325;
    }
    wall
    {
        type zeroGradient;
    }
    wedgeBack { type wedge; }
    wedgeFront { type wedge; }
}
